espressif/esp-idf/components/soc/esp32c3/include/soc/usb_device_reg.h
#define USB_DEVICE_FRAM_NUM_REG          (DR_REG_USB_DEVICE_BASE + 0x024)
/* USB_DEVICE_SOF_FRAME_INDEX : RO ;bitpos:[10:0] ;default: 11'd0 ; */
/*description: Frame index of received SOF frame.*/
#define USB_DEVICE_SOF_FRAME_INDEX  0x000007FF
#define USB_DEVICE_SOF_FRAME_INDEX_M  ((USB_DEVICE_SOF_FRAME_INDEX_V)<<(USB_DEVICE_SOF_FRAME_INDEX_S))
#define USB_DEVICE_SOF_FRAME_INDEX_V  0x7FF
#define USB_DEVICE_SOF_FRAME_INDEX_S  0

#define USB_DEVICE_IN_EP0_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x028)
/* USB_DEVICE_IN_EP0_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of IN endpoint 0.*/
#define USB_DEVICE_IN_EP0_RD_ADDR  0x0000007F
#define USB_DEVICE_IN_EP0_RD_ADDR_M  ((USB_DEVICE_IN_EP0_RD_ADDR_V)<<(USB_DEVICE_IN_EP0_RD_ADDR_S))
#define USB_DEVICE_IN_EP0_RD_ADDR_V  0x7F
#define USB_DEVICE_IN_EP0_RD_ADDR_S  9
/* USB_DEVICE_IN_EP0_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of IN endpoint 0.*/
#define USB_DEVICE_IN_EP0_WR_ADDR  0x0000007F
#define USB_DEVICE_IN_EP0_WR_ADDR_M  ((USB_DEVICE_IN_EP0_WR_ADDR_V)<<(USB_DEVICE_IN_EP0_WR_ADDR_S))
#define USB_DEVICE_IN_EP0_WR_ADDR_V  0x7F
#define USB_DEVICE_IN_EP0_WR_ADDR_S  2
/* USB_DEVICE_IN_EP0_STATE : RO ;bitpos:[1:0] ;default: 2'b1 ; */
/*description: State of IN Endpoint 0.*/
#define USB_DEVICE_IN_EP0_STATE  0x00000003
#define USB_DEVICE_IN_EP0_STATE_M  ((USB_DEVICE_IN_EP0_STATE_V)<<(USB_DEVICE_IN_EP0_STATE_S))
#define USB_DEVICE_IN_EP0_STATE_V  0x3
#define USB_DEVICE_IN_EP0_STATE_S  0

#define USB_DEVICE_IN_EP1_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x02C)
/* USB_DEVICE_IN_EP1_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of IN endpoint 1.*/
#define USB_DEVICE_IN_EP1_RD_ADDR  0x0000007F
#define USB_DEVICE_IN_EP1_RD_ADDR_M  ((USB_DEVICE_IN_EP1_RD_ADDR_V)<<(USB_DEVICE_IN_EP1_RD_ADDR_S))
#define USB_DEVICE_IN_EP1_RD_ADDR_V  0x7F
#define USB_DEVICE_IN_EP1_RD_ADDR_S  9
/* USB_DEVICE_IN_EP1_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of IN endpoint 1.*/
#define USB_DEVICE_IN_EP1_WR_ADDR  0x0000007F
#define USB_DEVICE_IN_EP1_WR_ADDR_M  ((USB_DEVICE_IN_EP1_WR_ADDR_V)<<(USB_DEVICE_IN_EP1_WR_ADDR_S))
#define USB_DEVICE_IN_EP1_WR_ADDR_V  0x7F
#define USB_DEVICE_IN_EP1_WR_ADDR_S  2
/* USB_DEVICE_IN_EP1_STATE : RO ;bitpos:[1:0] ;default: 2'b1 ; */
/*description: State of IN Endpoint 1.*/
#define USB_DEVICE_IN_EP1_STATE  0x00000003
#define USB_DEVICE_IN_EP1_STATE_M  ((USB_DEVICE_IN_EP1_STATE_V)<<(USB_DEVICE_IN_EP1_STATE_S))
#define USB_DEVICE_IN_EP1_STATE_V  0x3
#define USB_DEVICE_IN_EP1_STATE_S  0

#define USB_DEVICE_IN_EP2_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x030)
/* USB_DEVICE_IN_EP2_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of IN endpoint 2.*/
#define USB_DEVICE_IN_EP2_RD_ADDR  0x0000007F
#define USB_DEVICE_IN_EP2_RD_ADDR_M  ((USB_DEVICE_IN_EP2_RD_ADDR_V)<<(USB_DEVICE_IN_EP2_RD_ADDR_S))
#define USB_DEVICE_IN_EP2_RD_ADDR_V  0x7F
#define USB_DEVICE_IN_EP2_RD_ADDR_S  9
/* USB_DEVICE_IN_EP2_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of IN endpoint 2.*/
#define USB_DEVICE_IN_EP2_WR_ADDR  0x0000007F
#define USB_DEVICE_IN_EP2_WR_ADDR_M  ((USB_DEVICE_IN_EP2_WR_ADDR_V)<<(USB_DEVICE_IN_EP2_WR_ADDR_S))
#define USB_DEVICE_IN_EP2_WR_ADDR_V  0x7F
#define USB_DEVICE_IN_EP2_WR_ADDR_S  2
/* USB_DEVICE_IN_EP2_STATE : RO ;bitpos:[1:0] ;default: 2'b1 ; */
/*description: State of IN Endpoint 2.*/
#define USB_DEVICE_IN_EP2_STATE  0x00000003
#define USB_DEVICE_IN_EP2_STATE_M  ((USB_DEVICE_IN_EP2_STATE_V)<<(USB_DEVICE_IN_EP2_STATE_S))
#define USB_DEVICE_IN_EP2_STATE_V  0x3
#define USB_DEVICE_IN_EP2_STATE_S  0

#define USB_DEVICE_IN_EP3_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x034)
/* USB_DEVICE_IN_EP3_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of IN endpoint 3.*/
#define USB_DEVICE_IN_EP3_RD_ADDR  0x0000007F
#define USB_DEVICE_IN_EP3_RD_ADDR_M  ((USB_DEVICE_IN_EP3_RD_ADDR_V)<<(USB_DEVICE_IN_EP3_RD_ADDR_S))
#define USB_DEVICE_IN_EP3_RD_ADDR_V  0x7F
#define USB_DEVICE_IN_EP3_RD_ADDR_S  9
/* USB_DEVICE_IN_EP3_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of IN endpoint 3.*/
#define USB_DEVICE_IN_EP3_WR_ADDR  0x0000007F
#define USB_DEVICE_IN_EP3_WR_ADDR_M  ((USB_DEVICE_IN_EP3_WR_ADDR_V)<<(USB_DEVICE_IN_EP3_WR_ADDR_S))
#define USB_DEVICE_IN_EP3_WR_ADDR_V  0x7F
#define USB_DEVICE_IN_EP3_WR_ADDR_S  2
/* USB_DEVICE_IN_EP3_STATE : RO ;bitpos:[1:0] ;default: 2'b1 ; */
/*description: State of IN Endpoint 3.*/
#define USB_DEVICE_IN_EP3_STATE  0x00000003
#define USB_DEVICE_IN_EP3_STATE_M  ((USB_DEVICE_IN_EP3_STATE_V)<<(USB_DEVICE_IN_EP3_STATE_S))
#define USB_DEVICE_IN_EP3_STATE_V  0x3
#define USB_DEVICE_IN_EP3_STATE_S  0

#define USB_DEVICE_OUT_EP0_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x038)
/* USB_DEVICE_OUT_EP0_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of OUT endpoint 0.*/
#define USB_DEVICE_OUT_EP0_RD_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP0_RD_ADDR_M  ((USB_DEVICE_OUT_EP0_RD_ADDR_V)<<(USB_DEVICE_OUT_EP0_RD_ADDR_S))
#define USB_DEVICE_OUT_EP0_RD_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP0_RD_ADDR_S  9
/* USB_DEVICE_OUT_EP0_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of OUT endpoint 0. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT
 is detected  there are USB_DEVICE_OUT_EP0_WR_ADDR-2 bytes data in OUT EP0.*/
#define USB_DEVICE_OUT_EP0_WR_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP0_WR_ADDR_M  ((USB_DEVICE_OUT_EP0_WR_ADDR_V)<<(USB_DEVICE_OUT_EP0_WR_ADDR_S))
#define USB_DEVICE_OUT_EP0_WR_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP0_WR_ADDR_S  2
/* USB_DEVICE_OUT_EP0_STATE : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: State of OUT Endpoint 0.*/
#define USB_DEVICE_OUT_EP0_STATE  0x00000003
#define USB_DEVICE_OUT_EP0_STATE_M  ((USB_DEVICE_OUT_EP0_STATE_V)<<(USB_DEVICE_OUT_EP0_STATE_S))
#define USB_DEVICE_OUT_EP0_STATE_V  0x3
#define USB_DEVICE_OUT_EP0_STATE_S  0

