espressif/esp-idf/components/soc/esp32c3/include/soc/usb_device_reg.h
#define USB_DEVICE_OUT_EP1_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x03C)
/* USB_DEVICE_OUT_EP1_REC_DATA_CNT : RO ;bitpos:[22:16] ;default: 7'd0 ; */
/*description: Data count in OUT endpoint 1 when one packet is received.*/
#define USB_DEVICE_OUT_EP1_REC_DATA_CNT  0x0000007F
#define USB_DEVICE_OUT_EP1_REC_DATA_CNT_M  ((USB_DEVICE_OUT_EP1_REC_DATA_CNT_V)<<(USB_DEVICE_OUT_EP1_REC_DATA_CNT_S))
#define USB_DEVICE_OUT_EP1_REC_DATA_CNT_V  0x7F
#define USB_DEVICE_OUT_EP1_REC_DATA_CNT_S  16
/* USB_DEVICE_OUT_EP1_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of OUT endpoint 1.*/
#define USB_DEVICE_OUT_EP1_RD_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP1_RD_ADDR_M  ((USB_DEVICE_OUT_EP1_RD_ADDR_V)<<(USB_DEVICE_OUT_EP1_RD_ADDR_S))
#define USB_DEVICE_OUT_EP1_RD_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP1_RD_ADDR_S  9
/* USB_DEVICE_OUT_EP1_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of OUT endpoint 1. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT
 is detected  there are USB_DEVICE_OUT_EP1_WR_ADDR-2 bytes data in OUT EP1.*/
#define USB_DEVICE_OUT_EP1_WR_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP1_WR_ADDR_M  ((USB_DEVICE_OUT_EP1_WR_ADDR_V)<<(USB_DEVICE_OUT_EP1_WR_ADDR_S))
#define USB_DEVICE_OUT_EP1_WR_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP1_WR_ADDR_S  2
/* USB_DEVICE_OUT_EP1_STATE : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: State of OUT Endpoint 1.*/
#define USB_DEVICE_OUT_EP1_STATE  0x00000003
#define USB_DEVICE_OUT_EP1_STATE_M  ((USB_DEVICE_OUT_EP1_STATE_V)<<(USB_DEVICE_OUT_EP1_STATE_S))
#define USB_DEVICE_OUT_EP1_STATE_V  0x3
#define USB_DEVICE_OUT_EP1_STATE_S  0

#define USB_DEVICE_OUT_EP2_ST_REG          (DR_REG_USB_DEVICE_BASE + 0x040)
/* USB_DEVICE_OUT_EP2_RD_ADDR : RO ;bitpos:[15:9] ;default: 7'd0 ; */
/*description: Read data address of OUT endpoint 2.*/
#define USB_DEVICE_OUT_EP2_RD_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP2_RD_ADDR_M  ((USB_DEVICE_OUT_EP2_RD_ADDR_V)<<(USB_DEVICE_OUT_EP2_RD_ADDR_S))
#define USB_DEVICE_OUT_EP2_RD_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP2_RD_ADDR_S  9
/* USB_DEVICE_OUT_EP2_WR_ADDR : RO ;bitpos:[8:2] ;default: 7'd0 ; */
/*description: Write data address of OUT endpoint 2. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT
 is detected  there are USB_DEVICE_OUT_EP2_WR_ADDR-2 bytes data in OUT EP2.*/
#define USB_DEVICE_OUT_EP2_WR_ADDR  0x0000007F
#define USB_DEVICE_OUT_EP2_WR_ADDR_M  ((USB_DEVICE_OUT_EP2_WR_ADDR_V)<<(USB_DEVICE_OUT_EP2_WR_ADDR_S))
#define USB_DEVICE_OUT_EP2_WR_ADDR_V  0x7F
#define USB_DEVICE_OUT_EP2_WR_ADDR_S  2
/* USB_DEVICE_OUT_EP2_STATE : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: State of OUT Endpoint 2.*/
#define USB_DEVICE_OUT_EP2_STATE  0x00000003
#define USB_DEVICE_OUT_EP2_STATE_M  ((USB_DEVICE_OUT_EP2_STATE_V)<<(USB_DEVICE_OUT_EP2_STATE_S))
#define USB_DEVICE_OUT_EP2_STATE_V  0x3
#define USB_DEVICE_OUT_EP2_STATE_S  0

#define USB_DEVICE_MISC_CONF_REG          (DR_REG_USB_DEVICE_BASE + 0x044)
/* USB_DEVICE_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1'h1: Force clock on for register. 1'h0: Support clock only when
 application writes registers.*/
#define USB_DEVICE_CLK_EN  (BIT(0))
#define USB_DEVICE_CLK_EN_M  (BIT(0))
#define USB_DEVICE_CLK_EN_V  0x1
#define USB_DEVICE_CLK_EN_S  0

#define USB_DEVICE_MEM_CONF_REG          (DR_REG_USB_DEVICE_BASE + 0x048)
/* USB_DEVICE_USB_MEM_CLK_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: 1: Force clock on for usb memory.*/
#define USB_DEVICE_USB_MEM_CLK_EN  (BIT(1))
#define USB_DEVICE_USB_MEM_CLK_EN_M  (BIT(1))
#define USB_DEVICE_USB_MEM_CLK_EN_V  0x1
#define USB_DEVICE_USB_MEM_CLK_EN_S  1
/* USB_DEVICE_USB_MEM_PD : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: power down usb memory.*/
#define USB_DEVICE_USB_MEM_PD  (BIT(0))
#define USB_DEVICE_USB_MEM_PD_M  (BIT(0))
#define USB_DEVICE_USB_MEM_PD_V  0x1
#define USB_DEVICE_USB_MEM_PD_S  0

#define USB_DEVICE_DATE_REG          (DR_REG_USB_DEVICE_BASE + 0x080)
/* USB_DEVICE_DATE : R/W ;bitpos:[31:0] ;default: 32'h2007300 ; */
/*description: register version.*/
#define USB_DEVICE_DATE  0xFFFFFFFF
#define USB_DEVICE_DATE_M  ((USB_DEVICE_DATE_V)<<(USB_DEVICE_DATE_S))
#define USB_DEVICE_DATE_V  0xFFFFFFFF
#define USB_DEVICE_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_USB_DEVICE_REG_H_ */
